       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.

       PROCEDURE DIVISION.

       MAIN.
           DISPLAY "Hello world".


       STOP RUN.
